app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "kmp9z9dbn"], ["introduction", "hkoqejf3hbde7hfme3g"], ["updated_at", "2020-12-25 06:33:00.546782"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)